<?php
return [
    'common' => [
        'name' => 'Имя',
        'code' => 'Код',
        'parent_id' => 'Родительский раздел',
        'description' => 'Описание',
        'image' => 'Изображение',
        'required' => 'Поле :attribute обязательно для ввода',
        'max' => 'Поле :attribute должно иметь максимум :max символов',
        'min' => 'Поле :attribute должно иметь минимум :min символов',
        'unique' => 'Поле :attribute должно быть уникальным',
        'codeRegex' => 'Поле код не должно содержать ничего кроме цифр, латинских букв и символов тире и подчеркивания',
        'imageMimes' => 'Допустимые форматы изображения jpeg,jpg,png',
        'imageMax' => 'Допустимые размер изображения 5 МБ'
    ]
];

