<?php
return [
    'category' => [
        'index' => [
            'title' => 'Категории каталога',
            'description' => 'Описание главной страницы раздела "Категории каталога"',
            'table' => [
                'id' => 'Ид',
                'name' => 'Название',
                'code' => 'Код',
                'actions' => 'Действия',
                'button' => [
                    'create' => 'Создать категорию'
                ]
            ]
        ],
        'create' => [
            'title' => 'Создание категории',
        ],
        'edit' => [
            'title' => 'Редактирование категории',
        ],
    ],
    'brand' => [
        'index' => [
            'title' => 'Бренды каталога',
            'description' => 'Описание главной страницы раздела "Бренды каталога"',
            'table' => [
                'id' => 'Ид',
                'name' => 'Название',
                'code' => 'Код',
                'actions' => 'Действия',
                'button' => [
                    'create' => 'Создать бренд'
                ]
            ]
        ],
        'create' => [
            'title' => 'Создание бренда',
        ],
        'edit' => [
            'title' => 'Редактирование бренда',
        ],
    ],
    'product' => [
        'index' => [
            'title' => 'Товары каталога',
            'description' => 'Описание главной страницы раздела "Товары каталога"',
            'table' => [
                'id' => 'Ид',
                'name' => 'Название',
                'code' => 'Код',
                'category' => 'Категория',
                'actions' => 'Действия',
                'button' => [
                    'create' => 'Создать товар'
                ]
            ]
        ],
        'create' => [
            'title' => 'Создание товара',
        ],
        'edit' => [
            'title' => 'Редактирование товара',
        ],
    ],
    'search' => [
        'placeholder' => '',
        'button' => [
            'search' => 'Поиск'
        ],
    ]
];

